Ракович_В_Ю_70189466/src/InformationRegisters/УчетПосещений/УчетПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетПосещений</name>
  <attributes>
    <name>ВремяПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяУхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятыеМеры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.КабинетыМедПункта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.РегистрацияПосещения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПосещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ракович_В_Ю_70189466/src/InformationRegisters/УчетПосещений/ManagerModule.bsl
// Получить посещения студента за период
Функция ПолучитьПосещенияСтудента(Студент, ДатаНачала, ДатаОкончания) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    УчетПосещений.ДатаПосещения,
    |    УчетПосещений.ВремяПрихода,
    |    УчетПосещений.ВремяУхода,
    |    УчетПосещений.Причина,
    |    УчетПосещений.Температура,
    |    УчетПосещений.МедРаботник
    |ИЗ
    |    РегистрСведений.УчетПосещений КАК УчетПосещений
    |ГДЕ
    |    УчетПосещений.Студент = &Студент
    |    И УчетПосещений.ДатаПосещения МЕЖДУ &ДатаНачала И &ДатаОкончания
    |УПОРЯДОЧИТЬ ПО
    |    УчетПосещений.ДатаПосещения УБЫВ,
    |    УчетПосещений.ВремяПрихода УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Расчет времени приема
Функция РассчитатьВремяПриема(ВремяНачала, ВремяОкончания) Экспорт
    
    Если ВремяНачала = Неопределено Или ВремяОкончания = Неопределено Тогда
        Возврат 0;
    КонецЕсли;
    
    Разница = ВремяОкончания - ВремяНачала;
    Возврат Цел(Разница * 24 * 60); // в минутах
    
КонецФункции
